#Задание 1
temperature = float(input("Введите температуру в комнате: "))
if temperature >= 20:
    print(f"Температура {temperature}°C - Кондиционер: ВЫКЛЮЧЕН")
else:
    print(f"Температура {temperature}°C - Кондиционер: ВКЛЮЧЕН")

#Задание 2
